{
  "task_description": "{'component_name': 'Main Container for GolfMaster Live', 'description': 'Primary container for GolfMaster Live implementation: A mobile app for creating and managing golf tournaments and side games, supporting popular formats (match play, best ball, Nassau, Wolf, etc.), live scoring, bet tracking, and social features. Designed for intuitive, mobile-first use with real-time leaderboards, gamification, and group chat.', 'framework': 'flutter', 'platform': 'mobile', 'container': '{\n  "name": "ColorCraft frontend Container",\n  "features": [\n    {\n      "name": "Tournament Setup",\n      "description": "Create multi-day tournaments with custom rules (stroke play, match play, etc.), add participants, group pairings, and select course/hole info.",\n      "isEnabled": true\n    },\n    {\n      "name": "Score Input & Live Leaderboard",\n      "description": "Easy individual score entry (hole-by-hole or cumulative) with real-time leaderboard updates by format (net, gross, team), and visual indicators for skins, birdies, and eagles.",\n      "isEnabled": true\n    },\n    {\n      "name": "Game Mode Support",\n      "description": "Toggle between different golf games (Wolf, Nassau, Best Ball, Skins, etc.) with a rules engine for live outcome calculation.",\n      "isEnabled": true\n    },\n    {\n      "name": "Bet Tracking & Wagers",\n      "description": "Set and track bets per hole, round, or side game. Auto-calculate winnings/losses and provide a final payout summary.",\n      "isEnabled": true\n    },\n    {\n      "name": "Gamification & Social",\n      "description": "Earn badges for achievements, animated leaderboards, in-app group chat, and optional live polling for predictions.",\n      "isEnabled": true\n    },\n    {\n      "name": "Push Notifications",\n      "description": "Notify players when holes are completed or leads change.",\n      "isEnabled": true\n    },\n    {\n      "name": "GPS Player Positioning",\n      "description": "Show player locations on a GPS map during tournaments.",\n      "isEnabled": false\n    },\n    {\n      "name": "Score Validation",\n      "description": "Allow opponents to validate or approve scores to prevent errors.",\n      "isEnabled": true\n    },\n    {\n      "name": "Export & Sharing",\n      "description": "Export results to PDF or share to group chat/social media.",\n      "isEnabled": true\n    }\n  ],\n  "techStack": {\n    "frontend": [\n      "Flutter"\n    ],\n    "backend": [\n      "None"\n    ],\n    "language": [\n      "JavaScript (ES6+)"\n    ]\n  },\n  "colors": {\n    "primary": "#1A8F29",\n    "secondary": "#F5F5F5",\n    "accent": "#FFD700"\n  },\n  "theme": "light",\n  "layoutDescription": "Mobile-first UI with large, touch-friendly buttons, minimal text input, and color-coded elements for under/over par, leaders, and bet results. Main navigation includes Tournament Setup, Live Leaderboard, Game Modes, Bets, and Chat. Leaderboard features animated updates and visual badges. Quick access to repeat tournament structures and players."\n}'}",
  "tasks": {},
  "next_task_id": 1
}